date = ['2021-09-14', '2021-12-15', '2021-09-08', '2021-12-05', '2021-10-09',
        '2021-09-30', '2021-12-22', '2021-11-29', '2021-12-24', '2021-11-26',
        '2021-10-27', '2021-12-18', '2021-11-09', '2021-11-23', '2021-09-27',
        '2021-10-02', '2021-12-27', '2021-09-20', '2021-12-13', '2021-11-01',
        '2021-11-09', '2021-12-06', '2021-12-08', '2021-10-09', '2021-10-31',
        '2021-09-30', '2021-11-09', '2021-12-13', '2021-10-26', '2021-12-09']
cost = [1270, 8413, 9028, 3703, 5739, 4095, 295, 4944, 5723, 3701,
        4471, 651, 7037, 4274, 6275, 4988, 6930, 2971, 6592, 2004,
        2822, 519, 3406, 2732, 5015, 2008, 316, 6333, 5700, 2887]
# 1 Соедините два словаря в один
merge_lists = date + cost
print(merge_lists)
# 2 Напишите функцию, которая из двух списков, делает один словарь, где
# элементы из первого списка - ключи, а элементы из второго списка -
# значения

# merge_list_for_dict = dict(zip(date, cost))
# print(merge_list_for_dict)

def merge_list_for_dict(spisok_1:list, spisok_2:list) -> dict:
    new_dict = {}
    for i in range(len(spisok_1)):
        new_dict[spisok_1[i]] = spisok_2[i]
    return new_dict

# print(merge_list_for_dict(date, cost))
